Revit 2027 API
BuiltInFailures.TrussFailures.TrussInvalidSymbolGeom Property
 Truss is unable to generate any members due to layout family error.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussInvalidSymbolGeom { get; }
Public Shared ReadOnly Property TrussInvalidSymbolGeom As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussInvalidSymbolGeom {
	FailureDefinitionId^ get ();
}
static member TrussInvalidSymbolGeom : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace